In [13]:
import pandas as pd

file_name_06_27 = "data/weather_data_2026-01-13_06-27.parquet"
file_name_06_49 = "data/weather_data_2026-01-13_06-49.parquet"
file_name_07_29 = "data/weather_data_2026-01-13_07-29.parquet"
file_name_07_48 = "data/weather_data_2026-01-13_07-48.parquet"

df_06_27 = pd.read_parquet(file_name_06_27)
df_06_49 = pd.read_parquet(file_name_06_49)
df_07_29 = pd.read_parquet(file_name_07_29)
df_07_48 = pd.read_parquet(file_name_07_48)

In [14]:
df_06_27.head()

,city,temp_celsius,humidity,description,timestamp
0,Lagos,23.29,91,scattered clouds,2026-01-13T06:27:18.323362
1,London,9.60,91,scattered clouds,2026-01-13T06:27:19.680457
2,New York,1.88,60,clear sky,2026-01-13T06:27:20.962539
3,Tokyo,14.47,43,few clouds,2026-01-13T06:27:22.358996
4,Nairobi,16.62,82,few clouds,2026-01-13T06:27:23.766508

In [15]:
df_06_49.head()

,city,temp_celsius,humidity,description,timestamp
0,Lagos,24.73,83,overcast clouds,2026-01-13T06:48:57.505463
1,London,9.62,91,overcast clouds,2026-01-13T06:48:59.225809
2,New York,1.58,62,clear sky,2026-01-13T06:49:00.897320
3,Tokyo,14.57,42,few clouds,2026-01-13T06:49:02.533367
4,Nairobi,18.93,63,broken clouds,2026-01-13T06:49:04.429995

In [16]:
df_07_29.head()

,city,temp_celsius,humidity,description,timestamp
0,Lagos,23.29,91,scattered clouds,2026-01-13T07:29:39.210855
1,London,9.60,91,scattered clouds,2026-01-13T07:29:40.522153
2,New York,1.88,60,clear sky,2026-01-13T07:29:41.918053
3,Tokyo,14.47,43,few clouds,2026-01-13T07:29:43.249203
4,Nairobi,16.62,82,few clouds,2026-01-13T07:29:44.682953

In [17]:
df_07_48.head()

,city,temp_celsius,humidity,description,timestamp
0,Lagos,24.73,83,overcast clouds,2026-01-13T07:48:14.166830
1,London,9.62,91,overcast clouds,2026-01-13T07:48:15.815318
2,New York,1.58,62,clear sky,2026-01-13T07:48:17.443946
3,Tokyo,14.57,42,few clouds,2026-01-13T07:48:19.183082
4,Nairobi,18.93,63,broken clouds,2026-01-13T07:48:20.917440